<h2 style= "color: #663399"> Capítulo 8: Datos de agrupación </h2>

<h3 style="color:#FA8072"> Agrupacion basica </h3>
<h3 style="color:#FA8072"> Agrupar por una columna usando el siguiente DataFrame </h3>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'A': ['a', 'b', 'c', 'a', 'b', 'b'],
'B': [2, 8, 1, 4, 3, 8],
'C': [102, 98, 107, 104, 115, 87]})
df

   A  B    C
0  a  2  102
1  b  8   98
2  c  1  107
3  a  4  104
4  b  3  115
5  b  8   87

<h3 style="color:#FA8072"> Agrupe por columna A y obtenga el valor medio de otras columnas: </h3>

In [3]:
df.groupby('A').mean()

          B      C
A
a  3.000000  103.0
b  6.333333  100.0
c  1.000000  107.0

<h3 style="color:#FA8072"> Agrupar por columnas múltiples </h3>

In [6]:
df.groupby(['A','B']).mean()

         C
A B
a 2  102.0
  4  104.0
b 3  115.0
  8   92.5
c 1  107.0

In [7]:
#contar el número de elementos en cada grupo y calcular su media
df.groupby(['A','B']).agg(['count', 'mean'])

        C
    count   mean
A B
a 2     1  102.0
  4     1  104.0
b 3     1  115.0
  8     2   92.5
c 1     1  107.0

<h3 style="color:#FA8072"> Números de agrupación </h3>

In [8]:
np.random.seed(0)
df = pd.DataFrame({'Age': np.random.randint(20, 70, 100),
'Sex': np.random.choice(['Male', 'Female'], 100),
'number_of_foo': np.random.randint(1, 20, 100)})
df.head()

   Age     Sex  number_of_foo
0   64  Female             14
1   67  Female             14
2   20  Female             12
3   23    Male             17
4   23  Female             15

In [9]:
#También es posible definir etiquetas propias definiendo un parámetro

age_groups = pd.cut(df['Age'], bins=[19, 40, 65, np.inf])
df.groupby(age_groups)['number_of_foo'].mean()

Age
(19.0, 40.0]    9.880000
(40.0, 65.0]    9.452381
(65.0, inf]     9.250000
Name: number_of_foo, dtype: float64

In [10]:
# Tablas cruzadas por grupos de edad y género:
pd.crosstab(age_groups, df['Sex'])

Sex           Female  Male
Age
(19.0, 40.0]      22    28
(40.0, 65.0]      18    24
(65.0, inf]        3     5

<h3 style="color:#FA8072"> Columna de selección de un grupo. </h3>

In [11]:
#Cuando haces un grupo, puedes seleccionar una sola columna o una lista de columnas:
df = pd.DataFrame([[1, 1, 2], [1, 2, 3], [2, 3, 4]], columns=["A", "B", "C"])
df

   A  B  C
0  1  1  2
1  1  2  3
2  2  3  4

In [12]:
g = df.groupby("A")
g["B"].mean() # solo columna B

A
1    1.5
2    3.0
Name: B, dtype: float64

In [13]:
g[["B", "C"]].mean() # columnas B y C

     B    C
A
1  1.5  2.5
2  3.0  4.0

In [15]:
# También puede usar agg para especificar columnas:
g.agg({'B': 'mean', 'C': 'count'})

     B  C
A
1  1.5  2
2  3.0  1

<h3 style="color:#FA8072"> Agregando por tamaño versus por cuenta </h3>

In [17]:
df = pd.DataFrame( {"Name":["Alice", "Bob", "Mallory", "Mallory", "Bob" , "Mallory"],
"City":["Seattle", "Seattle", "Portland", "Seattle", "Seattle", "Portland"],
"Val": [4, 3, 3, np.nan, np.nan, 4]})
df

      Name      City  Val
0    Alice   Seattle  4.0
1      Bob   Seattle  3.0
2  Mallory  Portland  3.0
3  Mallory   Seattle  NaN
4      Bob   Seattle  NaN
5  Mallory  Portland  4.0

In [20]:
#size cuenta los valores de NaN 
df.groupby(["Name", "City"])['Val'].size().reset_index(name='Size')

      Name      City  Size
0    Alice   Seattle     1
1      Bob   Seattle     2
2  Mallory  Portland     2
3  Mallory   Seattle     1

In [21]:
# count cuenta los valores excluyendo NaN
df.groupby(["Name", "City"])['Val'].count().reset_index(name='Count')

      Name      City  Count
0    Alice   Seattle      1
1      Bob   Seattle      1
2  Mallory  Portland      2
3  Mallory   Seattle      0

<h3 style="color:#FA8072"> Agregando grupos </h3>

In [72]:
import numpy as np
import pandas as pd
datos = {'A': ('X','Y','Z','A','B','C','D','E','R','T'), 
                  'B': [1, 2, 1, 3, 1, 2, 3, 3, 1, 2],
                  'C': [12, 14, 11, 12, 13, 14, 16, 12, 10, 19]}
df=pd.DataFrame(datos)
df.groupby('A')['B'].agg({'mean': np.mean, 'standard deviation': np.std})

SpecificationError: nested renamer is not supported

In [33]:
df.groupby('A').agg({'B': [np.mean, np.std], 'C': [np.sum, 'count']})

          B             C
       mean       std sum count
A
X  2.250000  0.957427  59     4
Y  2.000000  1.000000  39     3
Z  1.333333  0.577350  35     3

In [34]:
# usar la transformación para obtener estadísticas a nivel de grupo mientras se preserva el marco de datos original
df = pd.DataFrame({'group1' : ['A', 'A', 'A', 'A','B', 'B', 'B', 'B'],'group2' : ['C', 'C', 'C', 'D','E', 'E', 'F', 'F'],
'B' : ['one', np.NaN, np.NaN, np.NaN,np.NaN, 'two', np.NaN, np.NaN],'C' : [np.NaN, 1, np.NaN, np.NaN,
np.NaN, np.NaN, np.NaN, 4]})
df

  group1 group2    B    C
0      A      C  one  NaN
1      A      C  NaN  1.0
2      A      C  NaN  NaN
3      A      D  NaN  NaN
4      B      E  NaN  NaN
5      B      E  two  NaN
6      B      F  NaN  NaN
7      B      F  NaN  4.0

In [114]:
# Quiero obtener el recuento de NaN de B para cada combinación de # group1 y group2 . 
#groupby.transform es una función muy poderosa que hace exactamente eso

df['count_B']=df.groupby(['group1','group2']).B.transform('count')
df

  group1 group2    B    C  count_B
0      A      C  one  NaN        1
1      A      C  NaN  1.0        1
2      A      C  NaN  NaN        1
3      A      D  NaN  NaN        0
4      B      E  NaN  NaN        1
5      B      E  two  NaN        1
6      B      F  NaN  NaN        0
7      B      F  NaN  4.0        0

<h2 style= "color: #663399"> Capítulo 9: Datos duplicados </h2>

<h3 style="color:#FA8072"> Seleccione duplicado </h3>

In [73]:
df = pd.DataFrame({'A':[1,2,3,3,2],
...: 'B':[1,7,3,0,8]})
df

   A  B
0  1  1
1  2  7
2  3  3
3  3  0
4  2  8

In [39]:
df = pd.DataFrame({'A':[1,2,3,3,2], 'B':[1,7,3,0,8]})
mask = df.A.duplicated(keep=False)
mask

0    False
1     True
2     True
3     True
4     True
Name: A, dtype: bool

In [74]:
df.loc [mask, 'B'] = 0
df['C'] = df.A.mask(mask, 0)
df

   A  B  C
0  1  1  1
1  2  0  0
2  3  0  0
3  3  0  0
4  2  0  0

In [42]:
df['C'] = df.A.mask(~mask, 0)
df

   A  B  C
0  1  1  0
1  2  0  2
2  3  0  3
3  3  0  3
4  2  0  2

<h3 style="color:#FA8072"> Drop duplicado </h3>

In [43]:
df = pd.DataFrame({'A':[1,2,3,3,2],'B':[1,7,3,0,8]})
df

   A  B
0  1  1
1  2  7
2  3  3
3  3  0
4  2  8

In [44]:
# mantener el ultimo valor de los duplicados
df.drop_duplicates(subset=['A'], keep='last')

   A  B
0  1  1
3  3  0
4  2  8

In [45]:
# mantener solo el primer valor
df.drop_duplicates(subset=['A'], keep='first')

   A  B
0  1  1
1  2  7
2  3  3

In [46]:
# eliminar todos los valores duplicados
df.drop_duplicates(subset=['A'], keep=False)

   A  B
0  1  1

In [48]:
# Cuando no desea obtener una copia de un marco de datos, pero para modificar el existente. Nos da el primer valor.
df = pd.DataFrame({'A':[1,2,3,3,2],'B':[1,7,3,0,8]})
df.drop_duplicates(subset=['A'], inplace=True)
df

   A  B
0  1  1
1  2  7
2  3  3

<h3 style="color:#FA8072"> Contando y consiguiendo elementos únicos. </h3>

In [49]:
#Número de elementos únicos en una serie
id_numbers = pd.Series([111, 112, 112, 114, 115, 118, 114, 118, 112])
id_numbers.nunique()

5

In [50]:
#Consigue elementos únicos en una serie
import numpy as np
from numpy import int64
id_numbers.unique()
np.array ([111, 112, 114, 115, 118], dtype=int64)
df = pd.DataFrame({'Group': list('ABAABABAAB'),'ID': [1, 1, 2, 3, 3, 2, 1, 2, 1, 3]})
df

  Group  ID
0     A   1
1     B   1
2     A   2
3     A   3
4     B   3
5     A   2
6     B   1
7     A   2
8     A   1
9     B   3

In [51]:
#Número de elementos únicos en cada grupo
In [6]: df.groupby('Group')['ID'].nunique()

Group
A    3
B    2
Name: ID, dtype: int64

In [52]:
# Consiga de elementos únicos en cada grupo
df.groupby('Group')['ID'].unique()

Group
A    [1, 2, 3]
B       [1, 3]
Name: ID, dtype: object

In [53]:
#Obtener valores únicos de una columna.
df = pd.DataFrame({"A":[1,1,2,3,1,1],"B":[5,4,3,4,6,7]})
df

   A  B
0  1  5
1  1  4
2  2  3
3  3  4
4  1  6
5  1  7

In [54]:
#Para obtener valores únicos en las columnas A y B.
df["A"].unique()

array([1, 2, 3], dtype=int64)

In [55]:
df["B"].unique()

array([5, 4, 3, 6, 7], dtype=int64)

In [56]:
pd.unique(df['A']).tolist()

[1, 2, 3]

In [57]:
df.loc['4', 'B'] = 4
df

     A    B
0  1.0  5.0
1  1.0  4.0
2  2.0  3.0
3  3.0  4.0
4  1.0  6.0
5  1.0  7.0
4  NaN  4.0

In [58]:
pd.unique(df[df['A'] == 1 ]['B']).tolist()

[5.0, 4.0, 6.0, 7.0]

In [59]:
df['A'] == 1
df

     A    B
0  1.0  5.0
1  1.0  4.0
2  2.0  3.0
3  3.0  4.0
4  1.0  6.0
5  1.0  7.0
4  NaN  4.0

In [60]:
df[df['A'] == 1]['B'].tolist()

[5.0, 4.0, 6.0, 7.0]

<h2 style= "color: #663399"> Capítulo 10: Datos perdidos </h2>

<h3 style="color:#FA8072"> Relleno de valores perdidos. </h3>

In [78]:
df = pd.DataFrame([[1, 2, None, 3], [4, None, 5, 6],[7, 8, 9, 10], [None, None, None, None]])
df

     0    1    2     3
0  1.0  2.0  NaN   3.0
1  4.0  NaN  5.0   6.0
2  7.0  8.0  9.0  10.0
3  NaN  NaN  NaN   NaN

In [81]:
# Rellene los valores faltantes con un solo valor:
df.fillna(0)

     0    1    2     3
0  1.0  2.0  0.0   3.0
1  4.0  0.0  5.0   6.0
2  7.0  8.0  9.0  10.0
3  0.0  0.0  0.0   0.0

In [64]:
#Rellene los valores faltantes con los anteriores:
df.fillna(method='pad') # este es equivalente a ='ffill' and .ffill()

     0    1    2     3
0  1.0  2.0  NaN   3.0
1  4.0  2.0  5.0   6.0
2  7.0  8.0  9.0  10.0
3  7.0  8.0  9.0  10.0

In [65]:
#Rellena con los siguientes:
df.fillna(method='bfill') # this is equivalent to .bfill()

     0    1    2     3
0  1.0  2.0  5.0   3.0
1  4.0  8.0  5.0   6.0
2  7.0  8.0  9.0  10.0
3  NaN  NaN  NaN   NaN

In [141]:
#Rellene utilizando otro DataFrame:
df2 = pd.DataFrame(np.arange(100, 116).reshape(4, 4))
df2

     0    1    2    3
0  100  101  102  103
1  104  105  106  107
2  108  109  110  111
3  112  113  114  115

In [142]:
df.fillna(df2) # toma los valores de  df2 para completar df

       0      1      2      3
0    1.0    2.0  102.0    3.0
1    4.0  105.0    5.0    6.0
2    7.0    8.0    9.0   10.0
3  112.0  113.0  114.0  115.0

<h3 style="color:#FA8072"> Bajando valores perdidos </h3>

In [155]:
#Cuando se crea un DataFrame, None (el valor faltante de python) se convierte a NaN (valor faltante de los pandas):
df = pd.DataFrame([[1, 2, None, 3], [4, None, 5, 6], [7, 8, 9, 10], [None, None, None, None]])
df

     0    1    2     3
0  1.0  2.0  NaN   3.0
1  4.0  NaN  5.0   6.0
2  7.0  8.0  9.0  10.0
3  NaN  NaN  NaN   NaN

In [156]:
#Eliminar filas si al menos una columna tiene un valor perdido
df.dropna()

     0    1    2     3
2  7.0  8.0  9.0  10.0

In [157]:
# Eliminar filas si faltan todos los valores de esa fila
df.dropna(how='all')

     0    1    2     3
0  1.0  2.0  NaN   3.0
1  4.0  NaN  5.0   6.0
2  7.0  8.0  9.0  10.0

In [158]:
# Eliminar columnas que no tengan al menos 3 valores no perdidos
df.dropna(axis=1, thresh=3)

     0     3
0  1.0   3.0
1  4.0   6.0
2  7.0  10.0
3  NaN   NaN

<h3 style="color:#FA8072"> Interpolación </h3>

In [165]:
df = pd.DataFrame({'A':[1,2,np.nan,3,np.nan], 'B':[1.2,7,3,0,8]})
df['C'] = df.A.interpolate()
df['D'] = df.A.interpolate(method='spline', order=1)
print (df)

     A    B    C         D
0  1.0  1.2  1.0  1.000000
1  2.0  7.0  2.0  2.000000
2  NaN  3.0  2.5  2.428571
3  3.0  0.0  3.0  3.000000
4  NaN  8.0  3.0  3.714286

<h3 style="color:#FA8072"> Comprobación de valores perdidos </h3>

In [166]:
ser = pd.Series([1, 2, np.nan, 4])
pd.isnull(ser)

0    False
1    False
2     True
3    False
dtype: bool

In [168]:
ser.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [170]:
df = pd.DataFrame({'A': [1, np.nan, 3], 'B': [np.nan, 5, 6]})
print(df)

     A    B
0  1.0  NaN
1  NaN  5.0
2  3.0  6.0

In [171]:
df.isnull() # Si el valor es NaN, returns True.

       A      B
0  False   True
1   True  False
2  False  False

In [172]:
df.notnull() # Opuesto de .isnull(). Si el valor no es NaN, el resultado es True.

       A      B
0   True  False
1  False   True
2   True   True